RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_dma.c
        /* disable synchronization mode and event generation for DMA request forward number configuration */
        DMAMUX_RM_CHXCFG(channelx) &= ~(DMAMUX_RM_CHXCFG_SYNCEN | DMAMUX_RM_CHXCFG_EVGEN);

        /* configure synchronization input identification, synchronization input polarity, number of DMA requests to forward */
        cfg = DMAMUX_RM_CHXCFG(channelx);
        cfg &= ~(DMAMUX_RM_CHXCFG_SYNCP | DMAMUX_RM_CHXCFG_NBR | DMAMUX_RM_CHXCFG_SYNCID);
        cfg |= (uint32_t)((init_struct->sync_polarity & DMAMUX_RM_CHXCFG_SYNCP) | RM_CHXCFG_NBR(init_struct->request_number - 1U) | \
                          (init_struct->sync_id & DMAMUX_RM_CHXCFG_SYNCID));
        DMAMUX_RM_CHXCFG(channelx) = cfg;
    }
}

/*!
    \brief      enable synchronization mode (API_ID(0x0027U))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..15)
    \param[out] none
    \retval     none
*/
void dmamux_synchronization_enable(dmamux_multiplexer_channel_enum channelx)
{
    DMAMUX_RM_CHXCFG(channelx) |= DMAMUX_RM_CHXCFG_SYNCEN;
}

/*!
    \brief      disable synchronization mode (API_ID(0x0028U))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..15)
    \param[out] none
    \retval     none
*/
void dmamux_synchronization_disable(dmamux_multiplexer_channel_enum channelx)
{
    DMAMUX_RM_CHXCFG(channelx) &= (~DMAMUX_RM_CHXCFG_SYNCEN);
}
/*!
    \brief      enable event generation (API_ID(0x0029U))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..15)
    \param[out] none
    \retval     none
*/
void dmamux_event_generation_enable(dmamux_multiplexer_channel_enum channelx)
{
    DMAMUX_RM_CHXCFG(channelx) |= DMAMUX_RM_CHXCFG_EVGEN;
}

/*!
    \brief      disable event generation (API_ID(0x002AU))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..15)
    \param[out] none
    \retval     none
*/
void dmamux_event_generation_disable(dmamux_multiplexer_channel_enum channelx)
{
    DMAMUX_RM_CHXCFG(channelx) &= (~DMAMUX_RM_CHXCFG_EVGEN);
}

/*!
    \brief      initialize the parameters of DMAMUX request generator structure with the default values (API_ID(0x002BU))
    \param[in]  init_struct: the initialization data needed to initialize DMAMUX request generator channel
    \param[out] none
    \retval     none
*/
void dmamux_gen_struct_para_init(dmamux_gen_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(DMA_MODULE_ID, API_ID(0x002BU), ERR_PARAM_POINTER);
    } else
#endif
    {
        /* set the DMAMUX request generator structure with the default values */
        init_struct->trigger_id        = DMAMUX_SYNC_EVT0_OUT;
        init_struct->trigger_polarity  = DMAMUX_SYNC_RISING;
        init_struct->request_number    = 1U;
    }
}

/*!
    \brief      initialize DMAMUX request generator channel (API_ID(0x002CU))
    \param[in]  channelx: specify which DMAMUX request generator channel is initialized
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_GENCHx(x=0..7)
    \param[in]  init_struct: the data needed to initialize DMAMUX request generator channel
                  trigger_id: DMAMUX_TRIGGER_EVT0_OUT, DMAMUX_TRIGGER_EVT1_OUT, DMAMUX_TRIGGER_EVT2_OUT, DMAMUX_TRIGGER_EVT3_OUT,
                              DMAMUX_TRIGGER_EVT4_OUT, DMAMUX_TRIGGER_EVT5_OUT, DMAMUX_TRIGGER_EVT6_OUT, DMAMUX_TRIGGER_EXTI0,
                              DMAMUX_TRIGGER_EXTI1, DMAMUX_TRIGGER_EXTI2, DMAMUX_TRIGGER_EXTI3, DMAMUX_TRIGGER_EXTI4,
                              DMAMUX_TRIGGER_EXTI5, DMAMUX_TRIGGER_EXTI6, DMAMUX_TRIGGER_EXTI7, DMAMUX_TRIGGER_EXTI8,
                              DMAMUX_TRIGGER_EXTI9, DMAMUX_TRIGGER_EXTI10, DMAMUX_TRIGGER_EXTI11, DMAMUX_TRIGGER_EXTI12,
                              DMAMUX_TRIGGER_EXTI13, DMAMUX_TRIGGER_EXTI14, DMAMUX_TRIGGER_EXTI15, DMAMUX_TRIGGER_RTC_WAKEUP,
                              DMAMUX_TRIGGER_CMP0_OUTPUT, DMAMUX_TRIGGER_CMP1_OUTPUT, DMAMUX_TRIGGER_I2C0_WAKEUP, DMAMUX_TRIGGER_I2C1_WAKEUP,
                              DMAMUX_TRIGGER_I2C2_WAKEUP, DMAMUX_TRIGGER_I2C3_WAKEUP, DMAMUX_TRIGGER_I2C0_INT_EVENT, DMAMUX_TRIGGER_I2C1_INT_EVENT,
                              DMAMUX_TRIGGER_I2C2_INT_EVENT, DMAMUX_TRIGGER_I2C3_INT_EVENT, DMAMUX_TRIGGER_ADC2_INT, DMAMUX_TRIGGER_ADC2_AWD0_OUT,
                              DMAMUX_TRIGGER_EXTI0_EVENT, DMAMUX_TRIGGER_EXTI1_EVENT, DMAMUX_TRIGGER_EXTI2_EVENT, DMAMUX_TRIGGER_EXTI3_EVENT,
                              DMAMUX_TRIGGER_EXTI4_EVENT, DMAMUX_TRIGGER_EXTI5_EVENT, DMAMUX_TRIGGER_EXTI6_EVENT, DMAMUX_TRIGGER_EXTI7_EVENT,
                              DMAMUX_TRIGGER_EXTI8_EVENT, DMAMUX_TRIGGER_EXTI9_EVENT, DMAMUX_TRIGGER_EXTI10_EVENT, DMAMUX_TRIGGER_EXTI11_EVENT,
                              DMAMUX_TRIGGER_EXTI12_EVENT, DMAMUX_TRIGGER_EXTI13_EVENT, DMAMUX_TRIGGER_EXTI14_EVENT, DMAMUX_TRIGGER_EXTI15_EVENT,
                              DMAMUX_TRIGGER_EXTI19_EVENT, DMAMUX_TRIGGER_EXTI20_EVENT, DMAMUX_TRIGGER_EXTI21_EVENT, DMAMUX_TRIGGER_EXTI33_EVENT,
                              DMAMUX_TRIGGER_EXTI34_EVENT, DMAMUX_TRIGGER_EXTI35_EVENT, DMAMUX_TRIGGER_EXTI36_EVENT
                  trigger_polarity: DMAMUX_GEN_NO_EVENT, DMAMUX_GEN_RISING, DMAMUX_GEN_FALLING, DMAMUX_GEN_RISING_FALLING
                  request_number: the number of DMA request that will be generated after a signal event, from 1 to 32
    \param[out] none
    \retval     none
*/
void dmamux_request_generator_init(dmamux_generator_channel_enum channelx, dmamux_gen_parameter_struct *init_struct)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(init_struct)) {
        fw_debug_report_err(DMA_MODULE_ID, API_ID(0x002BU), ERR_PARAM_POINTER);
    } else
#endif
    {
        uint32_t cfg;

        /* disable DMAMUX request generator channel for DMA request generation number configuration */
        DMAMUX_RG_CHXCFG(channelx) &= ~(DMAMUX_RG_CHXCFG_RGEN);

        /* configure trigger input identification, trigger polarity, number of DMA requests to be generated */
        cfg = DMAMUX_RG_CHXCFG(channelx);
        cfg &= ~(DMAMUX_RG_CHXCFG_TID | DMAMUX_RG_CHXCFG_RGTP | DMAMUX_RG_CHXCFG_NBRG);
        cfg |= (uint32_t)((init_struct->trigger_id & DMAMUX_RG_CHXCFG_TID) | (init_struct->trigger_polarity & DMAMUX_RG_CHXCFG_RGTP) | \
                          RG_CHXCFG_NBRG(init_struct->request_number - 1U));
        DMAMUX_RG_CHXCFG(channelx) = cfg;
    }
}

/*!
    \brief      enable DMAMUX request generator channel (API_ID(0x002DU))
    \param[in]  channelx: specify which DMAMUX request generator channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_GENCHx(x=0..7)
    \param[out] none
    \retval     none
*/
void dmamux_request_generator_channel_enable(dmamux_generator_channel_enum channelx)
{
    DMAMUX_RG_CHXCFG(channelx) |= DMAMUX_RG_CHXCFG_RGEN;
}

/*!
    \brief      disable DMAMUX request generator channel (API_ID(0x002EU))
    \param[in]  channelx: specify which DMAMUX request generator channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_GENCHx(x=0..7)
    \param[out] none
    \retval     none
*/
void dmamux_request_generator_channel_disable(dmamux_generator_channel_enum channelx)
{
    DMAMUX_RG_CHXCFG(channelx) &= (~DMAMUX_RG_CHXCFG_RGEN);
}

/*!
    \brief      configure synchronization input polarity (API_ID(0x002FU))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..15)
    \param[in]  polarity: synchronization input polarity
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_SYNC_NO_EVENT: no event detection
      \arg        DMAMUX_SYNC_RISING: rising edge
      \arg        DMAMUX_SYNC_FALLING: falling edge
      \arg        DMAMUX_SYNC_RISING_FALLING: rising and falling edges
    \param[out] none
    \retval     none
*/
void dmamux_synchronization_polarity_config(dmamux_multiplexer_channel_enum channelx, uint32_t polarity)
{
    DMAMUX_RM_CHXCFG(channelx) &= ~DMAMUX_RM_CHXCFG_SYNCP;
    DMAMUX_RM_CHXCFG(channelx) |= (uint32_t)(polarity & DMAMUX_RM_CHXCFG_SYNCP);
}

/*!
    \brief      configure number of DMA requests to forward (API_ID(0x0030U))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..15)
    \param[in]  number: DMA requests number to forward
                only one parameter can be selected which is shown as below:
      \arg        1 - 32
    \param[out] none
    \retval     none
*/
void dmamux_request_forward_number_config(dmamux_multiplexer_channel_enum channelx, uint32_t number)
{
    DMAMUX_RM_CHXCFG(channelx) &= ~DMAMUX_RM_CHXCFG_NBR;
    DMAMUX_RM_CHXCFG(channelx) |= (uint32_t)RM_CHXCFG_NBR(number - 1U);
}

/*!
    \brief      configure synchronization input identification (API_ID(0x0031U))
    \param[in]  channelx: specify which DMAMUX request multiplexer channel is configured
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_MUXCHx(x=0..15)
    \param[in]  id: synchronization input identification
                only one parameter can be selected which is shown as below:
      \arg        DMAMUX_SYNC_EVT0_OUT: synchronization input is Evt0_out
      \arg        DMAMUX_SYNC_EVT1_OUT: synchronization input is Evt1_out
      \arg        DMAMUX_SYNC_EVT2_OUT: synchronization input is Evt2_out
      \arg        DMAMUX_SYNC_EVT3_OUT: synchronization input is Evt3_out
      \arg        DMAMUX_SYNC_EVT4_OUT: synchronization input is Evt4_out
      \arg        DMAMUX_SYNC_EVT5_OUT: synchronization input is Evt5_out
      \arg        DMAMUX_SYNC_EVT6_OUT: synchronization input is Evt6_out
      \arg        DMAMUX_SYNC_EXTI0: synchronization input is EXTI0
      \arg        DMAMUX_SYNC_EXTI1: synchronization input is EXTI1
      \arg        DMAMUX_SYNC_EXTI2: synchronization input is EXTI2
      \arg        DMAMUX_SYNC_EXTI3: synchronization input is EXTI3
      \arg        DMAMUX_SYNC_EXTI4: synchronization input is EXTI4
      \arg        DMAMUX_SYNC_EXTI5: synchronization input is EXTI5
      \arg        DMAMUX_SYNC_EXTI6: synchronization input is EXTI6
      \arg        DMAMUX_SYNC_EXTI7: synchronization input is EXTI7
      \arg        DMAMUX_SYNC_EXTI8: synchronization input is EXTI8
      \arg        DMAMUX_SYNC_EXTI9: synchronization input is EXTI9
      \arg        DMAMUX_SYNC_EXTI10: synchronization input is EXTI10
      \arg        DMAMUX_SYNC_EXTI11: synchronization input is EXTI11
      \arg        DMAMUX_SYNC_EXTI12: synchronization input is EXTI12
      \arg        DMAMUX_SYNC_EXTI13: synchronization input is EXTI13
      \arg        DMAMUX_SYNC_EXTI14: synchronization input is EXTI14
      \arg        DMAMUX_SYNC_EXTI15: synchronization input is EXTI15
      \arg        DMAMUX_SYNC_RTC_WAKEUP: synchronization input is RTC wakeup
      \arg        DMAMUX_SYNC_CMP0_OUTPUT: synchronization input is CMP0 output
      \arg        DMAMUX_SYNC_I2C0_WAKEUP: synchronization input is I2C0 wakeup
      \arg        DMAMUX_SYNC_I2C1_WAKEUP: synchronization input is I2C1 wakeup
      \arg        DMAMUX_SYNC_I2C2_WAKEUP: synchronization input is I2C2 wakeup
      \arg        DMAMUX_SYNC_I2C3_WAKEUP: synchronization input is I2C3 wakeup
      \arg        DMAMUX_SYNC_EXTI0_EVENT: synchronization input is EXTI0_EVENT
      \arg        DMAMUX_SYNC_EXTI1_EVENT: synchronization input is EXTI1_EVENT
      \arg        DMAMUX_SYNC_EXTI2_EVENT: synchronization input is EXTI2_EVENT
      \arg        DMAMUX_SYNC_EXTI3_EVENT: synchronization input is EXTI3_EVENT
      \arg        DMAMUX_SYNC_EXTI4_EVENT: synchronization input is EXTI4_EVENT
      \arg        DMAMUX_SYNC_EXTI5_EVENT: synchronization input is EXTI5_EVENT
      \arg        DMAMUX_SYNC_EXTI6_EVENT: synchronization input is EXTI6_EVENT
      \arg        DMAMUX_SYNC_EXTI7_EVENT: synchronization input is EXTI7_EVENT
      \arg        DMAMUX_SYNC_EXTI8_EVENT: synchronization input is EXTI8_EVENT
      \arg        DMAMUX_SYNC_EXTI9_EVENT: synchronization input is EXTI9_EVENT
      \arg        DMAMUX_SYNC_EXTI10_EVENT: synchronization input is EXTI10_EVENT
      \arg        DMAMUX_SYNC_EXTI11_EVENT: synchronization input is EXTI11_EVENT
      \arg        DMAMUX_SYNC_EXTI12_EVENT: synchronization input is EXTI12_EVENT
      \arg        DMAMUX_SYNC_EXTI13_EVENT: synchronization input is EXTI13_EVENT
      \arg        DMAMUX_SYNC_EXTI14_EVENT: synchronization input is EXTI14_EVENT
      \arg        DMAMUX_SYNC_EXTI15_EVENT: synchronization input is EXTI15_EVENT
      \arg        DMAMUX_SYNC_EXTI19_EVENT: synchronization input is EXTI19_EVENT
      \arg        DMAMUX_SYNC_EXTI20_EVENT: synchronization input is EXTI20_EVENT
      \arg        DMAMUX_SYNC_EXTI33_EVENT: synchronization input is EXTI33_EVENT
      \arg        DMAMUX_SYNC_EXTI34_EVENT: synchronization input is EXTI34_EVENT
      \arg        DMAMUX_SYNC_EXTI35_EVENT: synchronization input is EXTI35_EVENT
      \arg        DMAMUX_SYNC_EXTI36_EVENT: synchronization input is EXTI36_EVENT
    \param[out] none
    \retval     none
*/
void dmamux_sync_id_config(dmamux_multiplexer_channel_enum channelx, uint32_t id)
{
    DMAMUX_RM_CHXCFG(channelx) &= ~DMAMUX_RM_CHXCFG_SYNCID;
    DMAMUX_RM_CHXCFG(channelx) |= (uint32_t)(id & DMAMUX_RM_CHXCFG_SYNCID);
}

